Catalogs/ВидыДоговоровАвторскогоЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ВидыДоговоровАвторскогоЗаказа</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодДоходаНДФЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодДоходаНДФЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоходаСтраховыеВзносы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовПоСтраховымВзносам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКодДоходаСтраховыеВзносы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВидыДоходовПоСтраховымВзносам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыДоговоровАвторскогоЗаказа/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьЭлемент(ОписаниеЭлемента)

	Объект = Справочники.ВидыДоговоровАвторскогоЗаказа.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(Объект, ОписаниеЭлемента);
	Объект.Записать();

КонецПроцедуры

// 4D:ERP для Беларуси, Петр, 26.12.2017 10:05:37 
// Редактировать справочник "Виды авторских договоров", № 17248
// {
Процедура ОбновитьПредопределенныеВидыДоговоров()

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыДоговоровАвторскогоЗаказа.Наименование,
	               |	ВидыДоговоровАвторскогоЗаказа.Ссылка
	               |ИЗ
	               |	Справочник.ВидыДоговоровАвторскогоЗаказа КАК ВидыДоговоровАвторскогоЗаказа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Наименование = "Создание литературных произведений"
			ИЛИ Выборка.Наименование = "Создание художественно-графических произведений" 
			ИЛИ Выборка.Наименование = "Создание произведений скульптуры, монументально-декоративной живописи" 
			ИЛИ Выборка.Наименование = "Создание аудиовизуальных произведений" 
			ИЛИ Выборка.Наименование = "Создание музыкально-сценических произведений" 
			ИЛИ Выборка.Наименование = "Создание других музыкальных произведений" 
			ИЛИ Выборка.Наименование = "Исполнение произведений литературы и искусства" 
			ИЛИ Выборка.Наименование = "Создание научных трудов и разработок" 
			ИЛИ Выборка.Наименование = "Открытия, изобретения и создание промышленных образцов" Тогда
			
			ВыборкаЭлемент = Выборка.Ссылка.ПолучитьОбъект();
			
			ВыборкаЭлемент.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию;
			ВыборкаЭлемент.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
			ВыборкаЭлемент.Записать();
			
		КонецЕсли; 
		
	КонецЦикла; 

КонецПроцедуры
// }
// 4D

Процедура СоздатьПредопределенныеВидыДоговоров() Экспорт

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА КАК ЗначениеИстина
	               |ИЗ
	               |	Справочник.ВидыДоговоровАвторскогоЗаказа КАК ВидыДоговоровАвторскогоЗаказа";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	// 4D:ERP для Беларуси, Петр, 26.12.2017 10:05:30 
	// Редактировать справочник "Виды авторских договоров", № 17248
	// {
	Если Не РезультатЗапроса.Пустой() Тогда 
		ОбновитьПредопределенныеВидыДоговоров();
		Возврат;
	КонецЕсли;	
	
	Описание = Новый Структура("
	|Наименование,
	|КодДоходаНДФЛ,
	|КодДоходаСтраховыеВзносы");
	
	Описание.Наименование = "Создание литературных произведений";
	Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию;
	Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	ЗаписатьЭлемент(Описание);
	
	Описание.Наименование = "Создание художественно-графических произведений";
	Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию;
	Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	ЗаписатьЭлемент(Описание);
	
	Описание.Наименование = "Создание произведений скульптуры, монументально-декоративной живописи";
	Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию;
	Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	ЗаписатьЭлемент(Описание);
	
	Описание.Наименование = "Создание аудиовизуальных произведений";
	Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию;
	Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	ЗаписатьЭлемент(Описание);
	
	Описание.Наименование = "Создание музыкально-сценических произведений";
	Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию;
	Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	ЗаписатьЭлемент(Описание);
	
	Описание.Наименование = "Создание других музыкальных произведений";
	Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию;
	Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	ЗаписатьЭлемент(Описание);
	
	Описание.Наименование = "Исполнение произведений литературы и искусства";
	Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию;
	Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	ЗаписатьЭлемент(Описание);
	
	Описание.Наименование = "Создание научных трудов и разработок";
	Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию;
	Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	ЗаписатьЭлемент(Описание);
	
	Описание.Наименование = "Открытия, изобретения и создание промышленных образцов";
	Описание.КодДоходаНДФЛ = Справочники.ВидыДоходовНДФЛ.КодДоходаПоУмолчанию;
	Описание.КодДоходаСтраховыеВзносы = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
	ЗаписатьЭлемент(Описание);
	// }
	// 4D
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
